Revit 2027 API
ScheduleDefinition.IsEmbedded Property
 Indicates if this is an embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEmbedded { get; }
Public ReadOnly Property IsEmbedded As Boolean
	Get
public:
property bool IsEmbedded {
	bool get ();
}
member IsEmbedded : bool with get
Property Value
Boolean
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace